#+TITLE: Desktop Configuration
#+STARTUP: fold

=M-x org-babel-tangle=

* List all installed packages
#+BEGIN_SRC sh :export raw
pacman -Qqe
#+END_SRC

#+RESULTS:
| alacarte                    |
| alacritty                   |
| alsa-utils                  |
| arandr                      |
| arduino                     |
| arduino-beta-bin            |
| autoconf                    |
| automake                    |
| baobab                      |
| base                        |
| binutils                    |
| bison                       |
| blueman                     |
| bluez                       |
| bluez-utils                 |
| brave-bin                   |
| bspwm                       |
| cheese                      |
| chrome-gnome-shell          |
| dhcpcd                      |
| dialog                      |
| discord                     |
| dosfstools                  |
| dunst                       |
| efibootmgr                  |
| emacs-git                   |
| eog                         |
| epiphany                    |
| evince                      |
| fakeroot                    |
| fd                          |
| feh                         |
| file                        |
| file-roller                 |
| findutils                   |
| flameshot                   |
| flex                        |
| gawk                        |
| gcc                         |
| gedit                       |
| geforcenow-electron         |
| gettext                     |
| git                         |
| gnome-backgrounds           |
| gnome-books                 |
| gnome-boxes                 |
| gnome-calculator            |
| gnome-calendar              |
| gnome-characters            |
| gnome-clocks                |
| gnome-color-manager         |
| gnome-contacts              |
| gnome-control-center        |
| gnome-disk-utility          |
| gnome-documents             |
| gnome-font-viewer           |
| gnome-keyring               |
| gnome-logs                  |
| gnome-maps                  |
| gnome-menus                 |
| gnome-music                 |
| gnome-photos                |
| gnome-remote-desktop        |
| gnome-screenshot            |
| gnome-session               |
| gnome-settings-daemon       |
| gnome-shell                 |
| gnome-shell-extensions      |
| gnome-software              |
| gnome-system-monitor        |
| gnome-terminal              |
| gnome-themes-extra          |
| gnome-tweaks                |
| gnome-user-docs             |
| gnome-user-share            |
| gnome-video-effects         |
| gnome-weather               |
| gptfdisk                    |
| grep                        |
| grilo-plugins               |
| groff                       |
| gvfs                        |
| gvfs-afc                    |
| gvfs-goa                    |
| gvfs-google                 |
| gvfs-gphoto2                |
| gvfs-mtp                    |
| gvfs-nfs                    |
| gvfs-smb                    |
| gzip                        |
| joplin-appimage             |
| lib32-giflib                |
| lib32-gnutls                |
| lib32-gst-plugins-base-libs |
| lib32-gtk3                  |
| lib32-libgcrypt             |
| lib32-libjpeg-turbo         |
| lib32-libpng                |
| lib32-libpulse              |
| lib32-libva                 |
| lib32-libxcomposite         |
| lib32-libxinerama           |
| lib32-libxslt               |
| lib32-mpg123                |
| lib32-nvidia-utils          |
| lib32-ocl-icd               |
| lib32-openal                |
| lib32-v4l-utils             |
| libtool                     |
| light                       |
| lightdm                     |
| lightdm-gtk-greeter         |
| linux                       |
| linux-firmware              |
| linux-headers               |
| lutris                      |
| m4                          |
| make                        |
| minecraft-launcher          |
| mpg123                      |
| mupdf                       |
| mutter                      |
| nautilus                    |
| netctl                      |
| networkmanager              |
| nextcloud-client            |
| nushell                     |
| nvidia                      |
| ocl-icd                     |
| openal                      |
| openssh                     |
| optimus-manager             |
| optimus-manager-qt          |
| orca                        |
| otf-overpass                |
| pacman                      |
| pacman-contrib              |
| patch                       |
| picom                       |
| pkgconf                     |
| polybar                     |
| proton-ge-custom-bin        |
| pulseaudio                  |
| pulseaudio-alsa             |
| pulseaudio-bluetooth        |
| python-adblock              |
| qutebrowser                 |
| reflector                   |
| ripgrep                     |
| rofi                        |
| ruby-fusuma                 |
| rygel                       |
| sed                         |
| simple-scan                 |
| spotify                     |
| steam                       |
| sudo                        |
| sushi                       |
| sxhkd                       |
| sxiv                        |
| texinfo                     |
| totem                       |
| touchegg                    |
| tracker                     |
| tracker-miners              |
| tracker3                    |
| tracker3-miners             |
| ttf-hack                    |
| ttf-jetbrains-mono          |
| ttf-ms-fonts                |
| vim                         |
| vino                        |
| visual-studio-code-bin      |
| wget                        |
| which                       |
| wine-staging                |
| wpa_supplicant              |
| xclip                       |
| xdg-user-dirs-gtk           |
| xf86-video-vesa             |
| xorg-bdftopcf               |
| xorg-docs                   |
| xorg-font-util              |
| xorg-fonts-100dpi           |
| xorg-fonts-75dpi            |
| xorg-fonts-encodings        |
| xorg-iceauth                |
| xorg-mkfontscale            |
| xorg-server                 |
| xorg-server-common          |
| xorg-server-devel           |
| xorg-server-xephyr          |
| xorg-server-xnest           |
| xorg-server-xvfb            |
| xorg-sessreg                |
| xorg-setxkbmap              |
| xorg-smproxy                |
| xorg-x11perf                |
| xorg-xauth                  |
| xorg-xbacklight             |
| xorg-xcmsdb                 |
| xorg-xcursorgen             |
| xorg-xdpyinfo               |
| xorg-xdriinfo               |
| xorg-xev                    |
| xorg-xgamma                 |
| xorg-xhost                  |
| xorg-xinput                 |
| xorg-xkbcomp                |
| xorg-xkbevd                 |
| xorg-xkbutils               |
| xorg-xkill                  |
| xorg-xlsatoms               |
| xorg-xlsclients             |
| xorg-xmodmap                |
| xorg-xpr                    |
| xorg-xprop                  |
| xorg-xrandr                 |
| xorg-xrdb                   |
| xorg-xrefresh               |
| xorg-xset                   |
| xorg-xsetroot               |
| xorg-xvinfo                 |
| xorg-xwayland               |
| xorg-xwd                    |
| xorg-xwininfo               |
| xorg-xwud                   |
| yay                         |
| yelp                        |
| zsh                         |
